package app

type Str struct {
	Text string
	Opis string
	Pod  map[int]Str
}

var Klase Str = Str{
	Text: "КЛАСИФИКАЦИЈА ОБЈЕКАТА",
	Opis: "ПРАВИЛНИК О КЛАСИФИКАЦИЈИ ОБЈЕКАТА(Сл. гласник РС, бр. 22/2015)",
	Pod: map[int]Str{
		1: {
			Text: "ЗГРАДЕ",
			Pod: map[int]Str{
				1: {
					Text: "СТАМБЕНЕ ЗГРАДЕ",
					Pod: map[int]Str{
						1: {
							Text: "Стамбене зграде са једним станом",
							Pod: map[int]Str{
								1: {
									Text: "Издвојене куће за становање или повремени боравак, као што су породичне куће, виле, викендице, летњиковци, планинске колибе, ловачке куће",
									Pod: map[int]Str{
										1: {
											Text: "До 400 м2 и П+1+Пк (ПС)",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "До 2.000 м2 и П+4+Пк (ПС)",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Преко 2.000 м2 или П+4+Пк (ПС)",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Куће у низу, спојене зидом, или низ спојених кућа на стрмини (терасама), у којима сваки стан има свој кров и свој улаз директно из приземља",
									Pod: map[int]Str{
										1: {
											Text: "До 2.000 м2 и П+4+Пк (ПС)",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Преко 2.000 м2 или П+4+Пк (ПС)",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						2: {
							Text: "Стамбене зграде са два или више станова",
							Pod: map[int]Str{
								1: {
									Text: "Стамбене зграде са два стана",
									Pod: map[int]Str{
										1: {
											Text: "Издвојене куће са два стана који се користе за стално становање или повремени боравак (за одмор и сл.)",
											Pod: map[int]Str{
												1: {
													Text: "До 400 м2 и П+1+Пк/ПС",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "До 2.000 м2 и П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Преко 2.000 м2 или П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Куће у низу, повезане зидом, или низ кућа спојених терасама (на стрмини), са два стана",
											Pod: map[int]Str{
												1: {
													Text: "До 2.000 м2 и П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Преко 2.000 м2 или П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
								2: {
									Text: "Стамбене зграде са три или више станова",
									Pod: map[int]Str{
										1: {
											Text: "Издвојене стамбене зграде са три стана, за стално становање или за повремени боравак",
											Pod: map[int]Str{
												1: {
													Text: "До 400 м2 и П+1+Пк/ПС",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "До 2.000 м2 и П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Преко 2.000 м2 или П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Издвојене и остале стамбене зграде са више од три стана, као што су стамбени блокови, куће са апартманима и сл. у којима су станови намењени за стално становање или за повремени",
											Pod: map[int]Str{
												1: {
													Text: "До 2.000 м2 и П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Преко 2.000 м2 или П+4+Пк (ПС)",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
							},
						},
						3: {
							Text: "Зграде за становање заједница",
							Pod: map[int]Str{
								1: {
									Text: "Зграде за заједничко становање, укључујући станове са потпуном услугом одржавања и чишћења за старије особе, студенте, децу и друге друштвене групе, као нпр. домови пензионера, установе и домове који пружају бригу за старије и хендикепиране особе, радничка преноћишта, студентске домове, сиротишта, преноћишта уз зграде интерната, домове бескућника, манастире и др.]",
									Pod: map[int]Str{
										1: {
											Text: "До 400 м2 и П+2",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Преко 400 м2 или П+2",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
					},
				},
				2: {
					Text: "НЕСТАМБЕНЕ ЗГРАДЕ",
					Pod: map[int]Str{
						1: {
							Text: "Хотели и сличне зграде",
							Pod: map[int]Str{
								1: {
									Text: "Хотели",
									Pod: map[int]Str{
										1: {
											Text: "Хотели, мотели, гостионице са собама, пансиони и сличне зграде за ноћење гостију, с рестораном или без њега",
											Pod: map[int]Str{
												1: {
													Text: "До 400 м2 и П+2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Преко 400 м2 или П+2",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Ресторани, барови и сличне угоститељске зграде",
											Opis: "Засебне зграде ресторана, барова, кантина",
											Pod: map[int]Str{
												1: {
													Text: "До 400 м2 и П+2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Преко 400 м2 или П+2",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
								2: {
									Text: "Остале зграде за краткотрајни боравак",
									Pod: map[int]Str{
										1: {
											Text: "Преноћишта за омладину (хостеле), планинарски домови, дечији и породични кампови, бунгалови за одмор, одмаралишта, друге зграде за одмор и ноћење излетника које нису другде разврстане",
											Pod: map[int]Str{
												1: {
													Text: "До 400 м2 и П+2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Преко 400 м2 или П+2",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
							},
						},
						2: {
							Text: "Пословне зграде",
							Pod: map[int]Str{
								1: {
									Text: "Зграде које се употребљавају у пословне сврхе, за административн е и управне сврхе (банке, поште, пословне зграде локалне управе и државних тела и др)",
									Pod: map[int]Str{
										1: {
											Text: "До 400 м2 и П+2",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Преко 400 м2 или П+2",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Конференцијски и конгресни центри, зграде судова и парламента",
									Pod: map[int]Str{
										1: {
											Text: "До 400 м2 и П+2",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Преко 400 м2 или П+2",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						3: {
							Text: "Зграде за трговину на велико и мало",
							Pod: map[int]Str{
								1: {
									Text: "Трговачки центри, зграде са продавницама, робне куће, издвојене продавнице, апотеке и бутици, сајамске хале, простори за аукције и изложбе, затворене пијаце, сервисне станице за моторна возила итд.",
									Pod: map[int]Str{
										1: {
											Text: "До 400 м2 и П+1",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Преко 400 м2 или П+1",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						4: {
							Text: "Зграде за саобраћај и комуникације",
							Pod: map[int]Str{
								1: {
									Text: "Зграде за комуникације, станице, терминали и сличне зграде",
									Pod: map[int]Str{
										1: {
											Text: "Зграде друмског саобраћаја",
											Pod: map[int]Str{
												1: {
													Text: "Зграде с припадајућим инсталацијама и уређајима у њима на аутобуским станицама",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Зграде железничког саобраћаја",
											Pod: map[int]Str{
												1: {
													Text: "Зграде с припадајућим инсталацијама и уређајима у њима на железничким станицама, на станицама жичара, седећих жичара, итд.",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Сигналне (скретничарске) кућице, спремишта (ремизе) за локомотиве и вагоне",
													Pod:  map[int]Str{},
												},
											},
										},
										3: {
											Text: "Зграде ваздушног саобраћаја",
											Pod: map[int]Str{
												1: {
													Text: "Зграде с припадајућим инсталацијама и уређајима у њима на цивилним и војним аеродромима",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Хангари за авионе",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Зграде за контролу летења (контролни торњеви)",
													Pod:  map[int]Str{},
												},
											},
										},
										4: {
											Text: "Зграде воденог саобраћаја",
											Pod: map[int]Str{
												1: {
													Text: "Зграде с припадајућим инсталацијама и уређајима у њима на лучким терминалима",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Светионици",
													Pod:  map[int]Str{},
												},
											},
										},
										5: {
											Text: "Зграде пошта и телекомуникација",
											Pod: map[int]Str{
												1: {
													Text: "Зграде поштанског промета, телефонске централе, телекомуникац ијски центри",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Телефонске говорнице",
													Pod:  map[int]Str{},
												},
											},
										},
										6: {
											Text: "Зграде за телевизијско и радио емитовање",
											Pod:  map[int]Str{},
										},

										7: {
											Text: "Остале зграде за саобраћај и комуникације",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Гараже",
									Pod: map[int]Str{
										1: {
											Text: "Самосталне зграде гаража (надземне и подземне) и паркиралишта",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Оставе за бицикле",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						5: {
							Text: "Индустријске зграде и складишта",
							Pod: map[int]Str{
								1: {
									Text: "Индустријске зграде",
									Pod: map[int]Str{
										1: {
											Text: "Наткривене зграде које се употребљавају за индустријску производњу, нпр. фабрике, радионице, кланице, пиваре, хале за монтажу итд.",
											Pod: map[int]Str{
												1: {
													Text: "радионице до 400 м2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "радионице преко 400 м2",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "све осим радионица",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
								2: {
									Text: "Резервоари, силоси и складишта",
									Pod: map[int]Str{
										1: {
											Text: "Резервоари и силоси",
											Pod: map[int]Str{
												1: {
													Text: "Резервоари и цистерне",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Резервоари за нафту и гас",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Силоси за цемент и друге суве агрегате",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Затворена складишта",
											Pod: map[int]Str{
												1: {
													Text: "Специјализован а складишта затворена с најмање три стране зидовима или преградама",
													Pod: map[int]Str{
														1: {
															Text: "До 1.500 м2 и П+1",
															Pod:  map[int]Str{},
														},
														2: {
															Text: "преко 1.500 м2 или П+1",
															Pod:  map[int]Str{},
														},
													},
												},
												2: {
													Text: "Хладњаче",
													Pod:  map[int]Str{},
												},
											},
										},
										3: {
											Text: "Наткривена складишта",
											Opis: "Стално наткривена складишта (с кровом) на отвореном, с мање од три зида или без зидова",
											Pod: map[int]Str{
												1: {
													Text: "До 1.500 м2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Више од 1.500 м²",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
							},
						},
						6: {
							Text: "Зграде за културно-уметничку делатност и забаву, образовање, болнице и остале зграде за здравствену заштиту",
							Pod: map[int]Str{
								1: {
									Text: "Зграде за културно-уметничку делатност и забаву",
									Pod: map[int]Str{

										1: {
											Text: "Биоскопи, концертне дворане, оперске куће, позоришта, итд.",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Дворане за састанке и вишенаменске дворане које се углавном употребљавају за културно- уметничку делатност и забаву",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Казина, циркуси, музичке и плесне дворане, плесне аматерске школе, дискотеке, павиљони за променадне концерте",
											Pod:  map[int]Str{},
										},
										4: {
											Text: "Зграде у зоолошким вртовима и ботаничким баштама",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Музеји и библиотеке",
									Pod: map[int]Str{

										1: {
											Text: "Музеји, уметничке галерије, библиотеке, информационо- документарни центри",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Зграде за чување архивске грађе",
											Pod:  map[int]Str{},
										},
									},
								},
								3: {
									Text: "Школске зграде и зграде за научноистраживачке делатности",
									Pod: map[int]Str{

										1: {
											Text: "Зграде дечјих вртића",
											Opis: "Зграде у којима се обавља предшколско образовање (јаслице, вртићи)",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Зграде основних школа",
											Pod: map[int]Str{

												1: {
													Text: "Зграде за основно образовање",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Зграде специјалних школа за хендикепирану децу",
													Pod:  map[int]Str{},
												},
											},
										},
										3: {
											Text: "Зграде средњих и осталих школа",
											Pod: map[int]Str{
												1: {
													Text: "Зграде средњих школа (нпр. гимназије, техничке и сродне школе, индустријске и друге стручне школе)",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Непрофесионал не возачке школе за моторна возила, за обуку летења и управљање пловним објектима",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Школе за образовање одраслих и школе којима се не може одредити образовни степен",
													Pod:  map[int]Str{},
												},
											},
										},
										4: {
											Text: "Зграде факултета",
											Opis: "Зграде универзитета, факултета, уметничких академија, високих и виших школа",
											Pod:  map[int]Str{},
										},
										5: {
											Text: "Зграде за научноистраживачку делатност",
											Pod: map[int]Str{
												1: {
													Text: "Зграде које се користе за научно истраживање, истраживачке лабораторије",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Метеоролошке станице, зграде опсерваторија",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
								4: {
									Text: "Болнице и остале зграде за здравствену заштиту",
									Pod: map[int]Str{

										1: {
											Text: "Зграде болница и клиника",
											Pod: map[int]Str{

												1: {
													Text: "Зграде општих и специјалних болница и клиника у којима се пружа медицинско и хируршко лечење и нега болесних и повређених особа",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Санаторијуми и друге болнице за дужи опоравак и негу болесника",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Психијатријске болнице, породилишта",
													Pod:  map[int]Str{},
												},
												4: {
													Text: "Универзитетске болнице, болнице за особе на преваспитању, затворенике и војнике",
													Pod:  map[int]Str{},
												},
												5: {
													Text: "Зграде болница и лечилишта које се користе за термално лечење, таласотерапију и функционалну рехабилитацију",
													Pod:  map[int]Str{},
												},
												6: {
													Text: "Установе са комбинованом услугом смештаја, исхране, неге и лечења за старије особе или хендикепирана лица",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Остале зграде за здравствену заштиту",
											Pod: map[int]Str{
												1: {
													Text: "Зграде домова здравља, здравствених станица, станица за хитну помоћ, поликлинике и лекарске ординације",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Центри за трансфузију крви, за прикупљање мајчиног млека",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Центри за заштиту мајки и деце",
													Pod:  map[int]Str{},
												},
											},
										},
										3: {
											Text: "Зграде за ветеринарско лечење",
											Opis: "Зграде ветеринарских станица, болница и приватних ординација за лечење животиња",
											Pod:  map[int]Str{},
										},
										4: {
											Text: "Спортске дворане",
											Pod: map[int]Str{
												1: {
													Text: "Зграде за спортове који се одржавају у затвореном простору (кошаркашка и тениска игралишта, пливалишта, гимнастичке дворане, хокеј итд.)и које имају просторе за гледаоце (трибине, подесте, терасе итд.) као и за учеснике (тушеве, гардеробе итд.)",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
							},
						},
						7: {
							Text: "Остале нестамбене зграде",
							Pod: map[int]Str{
								1: {
									Text: "Пољопривредне зграде",
									Pod: map[int]Str{
										1: {
											Text: "Стаје за стоку и живинарници",
											Opis: "Стаје за краве, овце и козе, коњушнице, свињци, штенаре и зграде за узгој др. животиња, индустријски и остали живинарници",
											Pod: map[int]Str{
												1: {
													Text: "До 600 м2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "До 4.000 м2 и висине до 25 м",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Преко 4.000 м2 или висине преко 25 м",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Зграде за узгој, производњу и смештај пољопривредни х производа",
											Opis: "Зграде за чување и узгој пољопривредни х производа нпр складишта за пољопривредне производе, амбари, кошеви, трапови, стакленици, винарије, вински подруми и др.",
											Pod: map[int]Str{
												1: {
													Text: "До 600 м2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "До 4.000 м2 и висине до 25 м",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Преко 4.000 м2 или висине преко 25 м",
													Pod:  map[int]Str{},
												},
											},
										},
										3: {
											Text: "Пољопривредни силоси",
											Pod: map[int]Str{
												1: {
													Text: "До 4.000 м2 и висине од 25 м",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Преко 4.000 м2 или висине преко 25 м",
													Pod:  map[int]Str{},
												},
											},
										},
										4: {
											Text: "Остале пољопривредне зграде",
											Pod: map[int]Str{
												1: {
													Text: "До 600 м2",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "До 4.000 м2 и висине до 25 м",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Преко 4.000 м2 или висине преко 25 м",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
								2: {
									Text: "Зграде за обављање верских и других обреда",
									Pod: map[int]Str{
										1: {
											Text: "Зграде за обављање верских обреда",
											Opis: "Цркве, капеле, џамије, синагоге, катедрале итд.",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Зграде на гробљима",
											Pod: map[int]Str{
												1: {
													Text: "Мртвачнице, крематоријуми",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "просторије за испраћај",
													Pod: map[int]Str{
														1: {
															Text: "до 200 м2",
															Pod:  map[int]Str{},
														},
														2: {
															Text: "преко 200 м2",
															Pod:  map[int]Str{},
														},
													},
												},
											},
										},
										3: {
											Text: "Остале грађевине на гробљима",
											Opis: "Гробнице са споменицима или без споменика",
											Pod:  map[int]Str{},
										},
									},
								},
								3: {
									Text: "Историјски или заштићени споменици",
									Pod: map[int]Str{
										1: {
											Text: "Историјске или заштићене зграде, било које врсте, које се не користе у друге сврхе",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Заштићене рушевине, археолошке ископине и преисторијска налазишта",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Кипови, комеморативне, уметничке и декоративне грађевине",
											Pod:  map[int]Str{},
										},
									},
								},
								4: {
									Text: "Остале зграде, другде некласификоване",
									Pod: map[int]Str{
										1: {
											Text: "Касарне и остале зграде за војску, полицију или ватрогасце",
											Opis: "Затвори, казненоправни центри и сл.",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Остале зграде, другде некласификоване",
											Opis: "Настрешнице на аутобуским станицама, јавни клозети, перионице итд.",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
					},
				},
			},
		},
		2: {
			Text: "ОСТАЛЕ ГРАЂЕВИНЕ",
			Pod: map[int]Str{
				1: {
					Text: "САОБРАЋАЈНА ИНФРАСТРУКТУРА",
					Pod: map[int]Str{
						1: {
							Text: "Аутопутеви, путеви и улице (за саобраћај моторних возила)",
							Pod: map[int]Str{
								1: {
									Text: "Аутопутеви и остали путеви",
									Pod: map[int]Str{
										1: {
											Text: "Аутопутеви",
											Pod: map[int]Str{
												1: {
													Text: "Путеви који су изграђени и намењени искључиво за саобраћај моторних возила, имају најмање четири саобраћајне траке тј. По две за сваки смер вожње, физички одвојене (ширине најмање 3,25 м) и по једну траку за заустављање возила у нужди, без укрштања са попречним путевима и пругом у истом нивоу.",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Све потребне инсталације (расвета, сигнализација) које омогућују сигурно одвијање саобраћаја и паркирања",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Остали путеви (за саобраћај моторних возила)",
											Pod: map[int]Str{
												1: {
													Text: "Путеви са најмање две саобраћајне траке ширине 3 м, којима је омогућен сигуран саобраћајни ток возила брзином од најмање 60 км-х, по којима се смеју кретати само моторна возила, укључујући и раскрснице",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Све потребне инсталације (расвета, сигнализација) које омогућују сигурно одвијање саобраћаја и паркирања",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
								2: {
									Text: "Остали путеви и улице",
									Pod: map[int]Str{
										1: {
											Text: "Улице и путеви унутар градова и осталих насеља, сеоски и шумски путеви и путеви на којима се одвија саобраћај моторних возила, бицикала и запрежних возила, укључујући раскрснице, обилазнице и кружне токове, отворена паркиралишта, пешачке стазе и зоне, тргови, бициклистичке и јахачке стазе",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Све потребне инсталације",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						2: {
							Text: "Железничке пруге",
							Pod: map[int]Str{
								1: {
									Text: "Међумесне железничке пруге",
									Pod: map[int]Str{
										1: {
											Text: "Главне железничке пруге јавног саобраћаја и споредни колосеци (укључујући горњи и доњи строј пруге), железничке станице, железнички прелази и раскрснице и пруге у ранжираним станицама",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Сва потребна железничка инфраструктура која омогућава сигурно одвијање саобраћаја (инсталације за расвету, сигнализацију, сигурност и електрификациј у)",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Градске железничке пруге",
									Pod: map[int]Str{
										1: {
											Text: "Градске железничке пруге",
											Pod: map[int]Str{
												1: {
													Text: "Градска и приградска мрежа железнице одвојена од осталог саобраћаја",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Градска подземна железница, надземна железница, жичана железница",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Инсталације за расвету, сигнализацију, сигурност и електрификациј у пруга",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Трамвајске пруге",
											Pod: map[int]Str{
												1: {
													Text: "Трамвајске пруге",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Инсталације за расвету, сигнализацију, сигурност и електрификациј у пруга",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
							},
						},
						3: {
							Text: "Аеродромске стазе",
							Pod: map[int]Str{
								1: {
									Text: "Аеродромске стазе",
									Pod: map[int]Str{
										1: {
											Text: "Стазе за полетање",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Инсталације за расвету, сигнализацију, сигурност промета писта",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						4: {
							Text: "Мостови, вијадукти, тунели и подземни пролази",
							Pod: map[int]Str{
								1: {
									Text: "Мостови и вијадукти",
									Pod: map[int]Str{
										1: {
											Text: "Друмски и железнички мостови (метални, армирано бетонски или од др. материјала) и вијадукти",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Инсталације за расвету, сигнализацију и сигурност промета на мостовима",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Покретни мостови, сеоски и шумски мостови са шинама, пешачки мостови",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Тунели и подземни пролази",
									Pod: map[int]Str{
										1: {
											Text: "Друмски и железнички тунели, галерије и подземни пролази",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Пешачки подземни пролази",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Инсталације за расвету, сигнализацију и сигурност промета у тунелима и пролазима",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						5: {
							Text: "Луке, пловни канали, бране и остали хидрограђевински објекти",
							Pod: map[int]Str{
								1: {
									Text: "Луке и пловни канали",
									Pod: map[int]Str{
										1: {
											Text: "Поморске и речне луке",
											Pod: map[int]Str{
												1: {
													Text: "Поморске и речне луке (пристаништа, докови, гатови, молови, итд.)",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Војна пристаништа",
													Pod:  map[int]Str{},
												},
												3: {
													Text: "Докови (навози) у бродоградилиш тима",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Пловни канали",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Грађевине на рекама и каналима",
											Opis: "Грађевине на рекама и каналима (устави, мостови и тунели на каналима), изграђене обале и путеви за тегљење уз обалу",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Бране и насипи",
									Pod: map[int]Str{
										1: {
											Text: "Бране и сличне конструкције за задржавање воде за било коју намену: за потребе хидроелектрана , наводњавање, регулацију водотока, заштиту од поплава",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Насипи, грађевине за заштиту обала",
											Pod:  map[int]Str{},
										},
									},
								},
								3: {
									Text: "Аквадукти, хидрограђевински објекти за одводњавање и наводњавање",
									Pod: map[int]Str{
										1: {
											Text: "Канали за наводњавање и друге грађевине за снабдевање водом ради култивисања земљишта",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Аквадукти",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Дренаже, отворене јаме за одвођење",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
					},
				},
				2: {
					Text: "ЦЕВОВОДИ, КОМУНИКАЦИОНИ И ЕЛЕКТРИЧНИ ВОДОВИ",
					Pod: map[int]Str{
						1: {
							Text: "Међумесни (даљински) цевоводи, комуникациони и електрични водови",
							Pod: map[int]Str{
								1: {
									Text: "Међумесни (даљински) нафтоводи и гасоводи",
									Pod:  map[int]Str{},
								},
								2: {
									Text: "Међумесни (даљински) водоводи",
									Pod:  map[int]Str{},
								},
								3: {
									Text: "Међумесни телекомуникациони водови",
									Pod:  map[int]Str{},
								},
								4: {
									Text: "Далеководи",
									Pod: map[int]Str{
										1: {
											Text: "Далеководи",
											Pod: map[int]Str{
												1: {
													Text: "Међумесни надземни или подземни водови за дистрибуцију електричне енергије високог или средњег напона",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Стубови далековода (пилони)",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Трансформаторске станице и подстанице",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						2: {
							Text: "Локални цевоводи и водови",
							Pod: map[int]Str{
								1: {
									Text: "Локална мрежа гасовода",
									Pod:  map[int]Str{},
								},
								2: {
									Text: "Локални водоводи, пароводи и топловоди",
									Pod: map[int]Str{
										1: {
											Text: "Локални водоводи",
											Opis: "Локални цевоводи за дистрибуцију воде (мрежа ван зграда)",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Остале грађевине у локалној водоводној мрежи",
											Opis: "Водоторњеви и други резервоари за воду, изворишта, фонтане (чесме), хидранти",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Пароводи и топловоди",
											Opis: "Локални цевоводи за топлу воду, пару или компромовани ваздух (цеви ван зграда)",
											Pod:  map[int]Str{},
										},
									},
								},
								3: {
									Text: "Канализациона мрежа",
									Pod: map[int]Str{
										1: {
											Text: "Јавна канализациона мрежа",
											Pod: map[int]Str{
												1: {
													Text: "Спољна канализациона мрежа",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Канализациони колектори",
													Pod:  map[int]Str{},
												},
											},
										},
										2: {
											Text: "Остала канализациона мрежа",
											Opis: "Спољни канализациони канали и колектори који нису у склопу јавне канализације, нпр. у болничком или фабричком округу, туристичким насељима итд.",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Објекти за прикупљање и пречишћавање отпадних вода",
											Opis: "Грађевине с одговарајућим уређајима за пречишћење отпадних вода или без њих (нпр. сабирне јаме, таложнице, сепаратори уља, септичке јаме)",
											Pod:  map[int]Str{},
										},
									},
								},
								4: {
									Text: "Локални, електрични и телекомуникациони водови",
									Pod: map[int]Str{
										1: {
											Text: "Локални електрични водови",
											Opis: "Локални електрични надземни или подземни водови",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Локалне трансформаторс ке станице",
											Opis: "Трансформаторске станице и подстанице",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Локални телекомуникаци они водови",
											Pod: map[int]Str{
												1: {
													Text: "Локални телекомуникац иони водови, надземни или подземни, као и помоћне инсталације (телеграфски стубови итд)",
													Pod:  map[int]Str{},
												},
												2: {
													Text: "Локални телевизијски каблови и заједничке антене",
													Pod:  map[int]Str{},
												},
											},
										},
									},
								},
							},
						},
					},
				},
				3: {
					Text: "СЛОЖЕНЕ ИНДУСТРИЈСКЕ ГРАЂЕВИНЕ",
					Pod: map[int]Str{
						1: {
							Text: "Сложени индустријски објекти и постројења (електране, рафинерије итд.) који нису зграде",
							Pod: map[int]Str{
								1: {
									Text: "Грађевине за рударство и вађење нафте и гаса",
									Pod: map[int]Str{
										1: {
											Text: "Објекти и постројење за рударство, вађење угљоводоника, каменоломи, експлоатација шљунка итд. (нпр. станице за утовар и истовар, торњеви за проветравање итд.)",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Објекти за производњу гипса, цемента, цигле и црепа итд.",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Електране",
									Pod: map[int]Str{
										1: {
											Text: "Објекти и опрема за производњу електричне енергије нпр. хидроелектране , термоелектране за угаљ, нуклеарне електране, електране на ветар",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Објекти и постројења за обраду и прераду нуклеарног материјала",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Пећи за спаљивање отпадака",
											Pod:  map[int]Str{},
										},
									},
								},
								3: {
									Text: "Грађевине и постројења за хемијску индустрију",
									Pod: map[int]Str{
										1: {
											Text: "Грађевински објекти и постројења у хемијској индустрији, петрохемијска постројења или рафинерије",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Терминали за угљоводонике",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Коксаре и плинаре",
											Pod:  map[int]Str{},
										},
									},
								},
								4: {
									Text: "Објекти и постројења у тешкој индустрији, другде некласификовани",
									Pod: map[int]Str{
										1: {
											Text: "Објекти и постројења у тешкој индустрији, другде некласификован и објекти и инсталације у тешкој индустрији, као што су високе пећи, ваљаонице челика, ливнице итд.",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
					},
				},
				4: {
					Text: "ОСТАЛЕ НЕПОМЕНУТЕ ГРАЂЕВИНЕ",
					Pod: map[int]Str{
						1: {
							Text: "Грађевине за спорт и рекреацију",
							Pod: map[int]Str{
								1: {
									Text: "Спортски терени",
									Pod: map[int]Str{
										1: {
											Text: "Терени и припадајући објекти (осим зграда) намењени за спортове који се одржавају на отвореномТерени и припадајући објекти (осим зграда) намењени за спортове који се одржавају на отвореном",
											Pod:  map[int]Str{},
										},
									},
								},
								2: {
									Text: "Остале грађевине за спорт и рекреацију",
									Pod: map[int]Str{
										1: {
											Text: "Пристаништа у маринама",
											Pod:  map[int]Str{},
										},
										2: {
											Text: "Забавни паркови, као и др. грађевине на отвореном, укључујући и грађевине на брдским теренима (скијашке стазе и лифтови, седеће жичаре итд.), игралишта за голф, спортска узлетишта, хиподроми, објекти који се претежно користе за водене спортове, опрема на плажама",
											Pod:  map[int]Str{},
										},
										3: {
											Text: "Јавни вртови и паркови, ЗОО вртови и ботаничке баште",
											Pod:  map[int]Str{},
										},
									},
								},
							},
						},
						2: {
							Text: "Остале грађевине (осим зграда) другде некласификоване",
							Pod: map[int]Str{
								1: {
									Text: "Војни објекти (утврђења, стражаре, бункери, стрелишта, центри за војно тестирање)",
									Pod:  map[int]Str{},
								},
								2: {
									Text: "Објекти другде некласификован и, укључујући места за лансирање сателита",
									Pod:  map[int]Str{},
								},
								3: {
									Text: "Одлагалиште смећа (депоније)",
									Pod:  map[int]Str{},
								},
							},
						},
					},
				},
			},
		},
	},
}
